app/Http/Controllers/Tramites/TramitesController.php

select count(*) as aggregate from "tram_operacion" inner join "tram_documento" as "d" on "oper_iddocumento" = "d"."iddocumento" inner join "tram_tipodocumento" as "td" on "d"."docu_idtipodocumento" = "td"."idtdoc" left join "tram_dependencia" as "ddoc" on "oper_depeid_d" = "ddoc"."iddependencia" left join "tram_dependencia" as "ddest" on "d"."docu_iddependencia" = "ddest"."iddependencia" left join "admin" as "u1" on "oper_usuid_d" = "u1"."id" inner join "admin" as "u" on "oper_idusuario" = "u"."id" where ("oper_procesado" = 0 and "oper_depeid_d" = 3 and "oper_usuid_d" = 3 and "oper_idtope" = 2 and "td"."idtdoc" is not null)
---
                        ['td.idtdoc', '<>', env("TIPO_DOC_PAPELETA")],
                    ];

                    return Operacion::where($where)
                        ->join('tram_documento as d', 'oper_iddocumento', '=', 'd.iddocumento')
                        ->join('tram_tipodocumento as td', 'd.docu_idtipodocumento', '=', 'td.idtdoc')
                        ->leftJoin('tram_dependencia as ddoc', 'oper_depeid_d', '=', 'ddoc.iddependencia')
                        ->leftJoin('tram_dependencia as ddest', 'd.docu_iddependencia', '=', 'ddest.iddependencia')
                        ->leftJoin('admin AS u1', 'oper_usuid_d', '=', 'u1.id')
                        ->join('admin AS u', 'oper_idusuario', '=', 'u.id')
                        ->count();