app/Http/Controllers/Administrador/DepedendenciaController.php

    public function index()
    {
        $datos=DB::table('tram_dependencia')->whereNull('depe_sigla')->where('depe_tipo',0)->orderBy('iddependencia','asc')->paginate(10);
---
select * from "tram_dependencia" where "depe_sigla" is null and "depe_tipo" = 0 order by "iddependencia" asc limit 10 offset 0
select count(*) as aggregate from "tram_dependencia" where "depe_sigla" is null and "depe_tipo" = 0