app/Http/Controllers/ClasificadorController.php

    public function index()
    {
        $datos=Clasificador::get();
---
select * from "clasificador"