app/Http/Controllers/ClasificadorController.php

select * from "clasificador" inner join "formatocobranzas" on "clasificador"."idformat" = "formatocobranzas"."idformato" order by "idclasificador" asc
---
    public function index()
    {
        $datos=Clasificador::join('formatocobranzas','clasificador.idformat','=','formatocobranzas.idformato')->orderBy('idclasificador','asc')->get();

update "clasificador" set "estado_cla" = 0, "updated_at" = '2023-02-21 21:06:38' where "idclasificador" = 2
---
    public function updateestado(Request $request)
    {
        $post = Clasificador::find($request->idcon);
        $post->estado_cla = $request->estado;
        $post->save();