app/Http/Controllers/CobranzasController.php

select * from "cobranzas" order by "idcobrazas" desc limit 10 offset 0
select count(*) as aggregate from "cobranzas"
---
    public function listacobranza()
    {
        //$lista=Cobranzas::join('formatocobranzas','cobranzas.idtipoformato','=','formatocobranzas.idformato')->paginate(10);
        $lista=Cobranzas::OrderBy('idcobrazas','DESC')->paginate(10);

select * from "cobranzas" where "idcobrazas" = '2'
select * from "detallecobranzas" where "codcobranza" = '2'
---
    public function imprimecobranza($id)
    {
        $date = Carbon::now();
        $fechaimpresion = $date->format('d-m-Y H:i:s');

        $cobra=Cobranzas::where('idcobrazas',$id)->get();
        $detcobra=Detallecobranza::where('codcobranza',$id)->get();