app/Http/Controllers/CobranzasController.php

select * from "cobranzas" where "idcobrazas" = '22'
select * from "detallecobranzas" where "codcobranza" = '22'
---
    public function buscarcobranzaid($id)
    {
        $cobra=Cobranzas::where('idcobrazas',$id)->get();
        $detalle=Detallecobranza::where('codcobranza',$id)->get();