app/Http/Controllers/CobranzasController.php

select * from "cobranzas"
---
    public function listacobranza()
    {
        $lista=Cobranzas::get();

insert into "cobranzas" ("idusuario", "idtipoformato", "codigorecibo", "fechaemision", "ruc", "dni", "nom_razonsocial", "montonumero", "montotexto", "updated_at", "created_at") values (3, '1', '2023-000003', '2023-02-16', 'null', '42282733', 'WILMER OCHOA', '30.90', 'TREINTA CON 90/100 SOLES', '2023-02-16 08:35:41', '2023-02-16 08:35:41') returning "idcobrazas"
---
    public function generarcobranza(Request $request)
    {
        // $datos=$request->all();
        $formatter = new NumeroALetras();

        $iduser=Auth::user()->id;

        $idtipoformato=$request->idtipoformato;
        $codigorecibo=$request->codigorecibo;
        $fechaemision=$request->fechaemision;
        $ruc=$request->ruc;
        $dni=$request->dni;
        $nom_razonsocial=$request->nom_razonsocial;
        $montonumero=$request->montonumero;
        $montotexto=$formatter->toInvoice($montonumero, 2, 'soles');



        $tram_cobramza=Cobranzas::create([
            'idusuario'=>$iduser,
            'idtipoformato'=>$idtipoformato,
            'codigorecibo'=>$codigorecibo,
            'fechaemision'=>$fechaemision,
            'ruc'=>$ruc,
            'dni'=>$dni,
            'nom_razonsocial'=>$nom_razonsocial,
            'montonumero'=>$montonumero,
            'montotexto'=>$montotexto
        ]);

select "numeracion" from "formatocobranzas" where "idformato" = '1' limit 1
---
                $det->save();
            }

            $numeracion=Formatocobranza::where('idformato',$idtipoformato)->value('numeracion');

select * from "cobranzas" where "idcobrazas" = '1'
select * from "detallecobranzas" where "codcobranza" = '1'
---
    public function imprimecobranza($id)
    {
        $date = Carbon::now();
        $fechaimpresion = $date->format('d-m-Y H:i:s');

        $cobra=Cobranzas::where('idcobrazas',$id)->get();
        $detcobra=Detallecobranza::where('codcobranza',$id)->get();