app/Http/Controllers/ConceptocobranzaController.php

select * from "conceptocobranzas" inner join "clasificador" on "conceptocobranzas"."codclasificador" = "clasificador"."idclasificador" order by "idconceptocobranza" asc
---
    public function index()
    {
        //
        $datos=Conceptocobranza::join('clasificador','conceptocobranzas.codclasificador','=','clasificador.idclasificador')->orderBy('idconceptocobranza','asc')->get();

select * from "conceptocobranzas" where "idconceptocobranza" = '4'
---
    public function busqueda($id)
    {
        $datos=Conceptocobranza::where('idconceptocobranza',$id)->get();

update "conceptocobranzas" set "estado_concepto" = 0, "updated_at" = '2023-02-21 20:33:35' where "idconceptocobranza" = 1
---
    public function updateestado(Request $request)
    {
        $post = Conceptocobranza::find($request->idcon);
        $post->estado_concepto = $request->estado;
        $post->save();