app/Http/Controllers/ConceptocobranzaController.php

select * from "conceptocobranzas" inner join "clasificador" on "conceptocobranzas"."codclasificador" = "clasificador"."idclasificador"
---
    public function index()
    {
        //
        $datos=Conceptocobranza::join('clasificador','conceptocobranzas.codclasificador','=','clasificador.idclasificador')->get();