app/Http/Controllers/DetallecobranzaController.php

    public function updatedetalleconceptouser(Request $request)
    {

        // para modificar al usuario
        $idrucdni=$request->ruc;
        $nombreorazon=$request->nombreorazon;
        $idcobranzas=$request->idcobranzas;
        // para contar carateres de numero doc// dni o ruc
        // if(strlen($idrucdni)>=11){$ruc=$idrucdni;$dni='null';}
        // else{$dni=$idrucdni;$ruc='null';}

        $cob = Cobranzas::find($idcobranzas);
        $cob->nom_razonsocial=$nombreorazon;
        // $cob->ruc=$ruc;
        // $cob->dni=$dni;
        $cob->save();
---
update "cobranzas" set "nom_razonsocial" = 'WILMER OCHOA ALVARADr', "updated_at" = '2023-07-12 16:30:02' where "idcobrazas" = 22