app/Http/Controllers/FormatocobranzaController.php

    public function index()
    {
        //
        $datos=Formatocobranza::orderBy('idformato','asc')->get();
---
select * from "formatocobranzas" order by "idformato" asc

    public function buscar()
    {
        //cobranzasid
        $datos=Cobranzas::orderBy('idcobrazas', 'desc')->limit(1)->value('idcobrazas');
---
select "idcobrazas" from "cobranzas" order by "idcobrazas" desc limit 1