app/Http/Controllers/FormatocobranzaController.php

    public function index()
    {
        //
        $datos=Formatocobranza::get();
---
select * from "formatocobranzas"