app/Http/Controllers/Reportes.php

select * from "cobranzas" where "fechaemision" between '2023-03-06' and '2023-03-08' order by "idcobrazas" desc limit 10 offset 0
select count(*) as aggregate from "cobranzas" where "fechaemision" between '2023-03-06' and '2023-03-08'
---
    public function reporfecha(Request $request)
    {
        $fec_i=$request->fechaini;
        $fec_f=$request->fechafin;

        $lista=Cobranzas::whereBetween('fechaemision',[$fec_i,$fec_f])->OrderBy('idcobrazas','DESC')->paginate(10);

select * from "cobranzas" where "fechaemision" between '2023-03-06' and '2023-03-08' order by "idcobrazas" desc
---
    public function reporfecha_des(Request $request)
    {
        $fec_i=$request->fechaini;
        $fec_f=$request->fechafin;
        //$sumas=$request->suma;
        $lista=Cobranzas::whereBetween('fechaemision',[$fec_i,$fec_f])->OrderBy('idcobrazas','DESC')->get();