app/Http/Controllers/Resumen.php

select sum("monto") as aggregate from "detallecobranzas"
select count(*) as aggregate from "conceptocobranzas"
select count(*) as aggregate from "formatocobranzas"
---
    public function index()
    {
        $cobranzas=Detallecobranza::sum('monto');
        $conceptos=Conceptocobranza::count();
        $formatos=Formatocobranza::count();